Статистика работы механизмов/Конфигурация/DataProcessors/_ВыгрузкаДанныхДляОбменаСФондамиИСпецдепами.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<DataProcessor>
		<Properties>
			<Name>_ВыгрузкаДанныхДляОбменаСФондамиИСпецдепами</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>КаталогДанных</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Период</Name>
					<Type>
						<v8:Type>v8:StandardPeriod</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДополнительныеПараметрыВыгрузки</Name>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПринудительноВыгрузитьНачальныеОстатки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыгрузкаВИнфинитум</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбезличеннаяВыгрузка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоказыватьВремяФормированияПакетов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Периодичность</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПериодичностьПредоставленияОтчетности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

Статистика работы механизмов/Конфигурация/DataProcessors/_ВыгрузкаДанныхДляОбменаСФондамиИСпецдепами/Forms/Форма/Ext/Form/Module.bsl
&НаСервере
Процедура ВыгрузитьДанныеНаСервере()
	
	Для Каждого ЭлементСписка Из СписокСчетовДУ Цикл
		Объект.СчетДоверительногоУправления = ЭлементСписка.Значение;
		Если ЗначениеЗаполнено(Объект.СчетДоверительногоУправления) Тогда
			ТекущийОбъект = РеквизитФормыВЗначение("Объект");
			ТекущийОбъект.ВыгрузитьДанные();
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ОтправитьФайлНаСервере()
	ТекущийОбъект = РеквизитФормыВЗначение("Объект");
	ТекущийОбъект.АвтоматическоеФормирование(ЭтаФорма.НастройкиОтчета);
	Если НастройкиОтчета.Свойство("Результат") Тогда
		РаботаСОтчетами.ОтправитьОтчет(ЭтаФорма.НастройкиОтчета, ЭтаФорма.НастройкиОтчета.Результат);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузитьДанные(Команда)
	
	Если СписокСчетовДУ.Количество() = 0 Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не выбрано не одного счета ДУ!");
		Возврат;
	КонецЕсли;
	
	Объект.ДополнительныеПараметрыВыгрузки = Новый Структура;
	
	Если Объект.Период.ДатаОкончания = Дата(2016, 12, 31, 23, 59, 59)
		ИЛИ Объект.ПринудительноВыгрузитьНачальныеОстатки Тогда
		Если Вопрос("Выгрузить остатки по бухгалтерии в виде проводок с 000 счетом?", РежимДиалогаВопрос.ДаНет, 60) = КодВозвратаДиалога.Да Тогда
			Объект.ДополнительныеПараметрыВыгрузки.Вставить("ВыгрузитьОстаткиПоБухгалтерииВВидеПроводокС000Счетом", Истина);
		КонецЕсли;
	КонецЕсли;
		
	
	ВыгрузитьДанныеНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ПутьВыгрузкиНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога); 
	Диалог.Каталог            = Объект.КаталогДанных; 
	Диалог.МножественныйВыбор = Ложь; 
	Диалог.Заголовок          = "Выберите каталог"; 
	
	Если Диалог.Выбрать() Тогда 
		Объект.КаталогДанных = Диалог.Каталог;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПутьВыгрузкиОткрытие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ЗапуститьПриложение(Объект.КаталогДанных + "\");

КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
    РаботаСФормами.УстановитьВерсиюДополнительногоОтчетаОбработки(ЭтаФорма);
				
	Объект.Организация = ОбщегоНазначения.ЗначениеПараметраСеанса("ТекущаяОрганизация");	
	Параметры.Свойство("НастройкиОтчета", ЭтаФорма.НастройкиОтчета);
	
	Объект.Периодичность = Перечисления.ПериодичностьПредоставленияОтчетности.Ежедневно;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокСчетовДУОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	СтандартнаяОбработка = СписокСчетовДУ.НайтиПоЗначению(ВыбранноеЗначение) = Неопределено;
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьПоИдентификатору(Команда)
	
	ОткрытьФорму("ВнешняяОбработка._ВыгрузкаДанныхДляОбменаСФондамиИСпецдепами.Форма.ОткрытьПоИдентификатору");
	
КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	
	РаботаСФормами.ПриЗагрузкеДанныхИзНастроек(ЭтаФорма);
	
КонецПроцедуры
